Unsure. Tried to reproduce it with this terraspace example project that 

* creates security groups 
* with different provider aliases
* on different AWS accounts
* using different roles to assume

Here's the repo: https://github.com/tongueroo/terraspace-multiple-providers

Here's also the debugging output:

<details>
 <summary>Click to Expand and See Debugging Session</summary>

    $ terraspace up demo -y
    Building .terraspace-cache/us-west-2/dev/stacks/demo
    Built in .terraspace-cache/us-west-2/dev/stacks/demo
    Current directory: .terraspace-cache/us-west-2/dev/stacks/demo
    => terraform plan -input=false -out /tmp/terraspace/plans/demo-5620d45a4deda68126b91aff6dc4e562.plan
    
    Terraform used the selected providers to generate the following execution
    plan. Resource actions are indicated with the following symbols:
      + create
    
    Terraform will perform the following actions:
      # random_pet.pet1 will be created
      + resource "random_pet" "pet1" {
          + id        = (known after apply)
          + length    = 2
          + separator = "-"
        }
      # random_pet.pet2 will be created
      + resource "random_pet" "pet2" {
          + id        = (known after apply)
          + length    = 2
          + separator = "-"
        }
      # module.sg1.aws_security_group.this will be created
      + resource "aws_security_group" "this" {
          + arn                    = (known after apply)
          + description            = (known after apply)
          + egress                 = (known after apply)
          + id                     = (known after apply)
          + ingress                = (known after apply)
          + name                   = (known after apply)
          + name_prefix            = (known after apply)
          + owner_id               = (known after apply)
          + revoke_rules_on_delete = false
          + tags_all               = (known after apply)
          + vpc_id                 = (known after apply)
        }
      # module.sg2.aws_security_group.this will be created
      + resource "aws_security_group" "this" {
          + arn                    = (known after apply)
          + description            = (known after apply)
          + egress                 = (known after apply)
          + id                     = (known after apply)
          + ingress                = (known after apply)
          + name                   = (known after apply)
          + name_prefix            = (known after apply)
          + owner_id               = (known after apply)
          + revoke_rules_on_delete = false
          + tags_all               = (known after apply)
          + vpc_id                 = (known after apply)
        }
    
    Plan: 4 to add, 0 to change, 0 to destroy.
    
    Changes to Outputs:
      + sg1_arn = (known after apply)
      + sg2_arn = (known after apply)
    
    ─────────────────────────────────────────────────────────────────────────────
    
    Saved the plan to: /tmp/terraspace/plans/demo-5620d45a4deda68126b91aff6dc4e562.plan
    
    To perform exactly these actions, run the following command to apply:
        terraform apply "/tmp/terraspace/plans/demo-5620d45a4deda68126b91aff6dc4e562.plan"
    => terraform apply -auto-approve -input=false /tmp/terraspace/plans/demo-5620d45a4deda68126b91aff6dc4e562.plan
    random_pet.pet1: Creating...
    random_pet.pet2: Creating...
    random_pet.pet1: Creation complete after 0s [id=notable-lobster]
    random_pet.pet2: Creation complete after 0s [id=sensible-seal]
    module.sg1.aws_security_group.this: Creating...
    module.sg2.aws_security_group.this: Creating...
    module.sg1.aws_security_group.this: Creation complete after 1s [id=sg-063c8fb1ab95ec2fe]
    module.sg2.aws_security_group.this: Creation complete after 3s [id=sg-04e5c4ed437502e2a]
    
    Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
    
    
    Outputs:
    
    sg1_arn = "arn:aws:ec2:us-west-2:111111111111:security-group/sg-063c8fb1ab95ec2fe"
    sg2_arn = "arn:aws:ec2:us-east-1:222222222222:security-group/sg-04e5c4ed437502e2a"
    Time took: 7s
    $
</details>

It just deploys 2 security groups. Each one using a different provider and different region. It outputs the security ARN so can easily debug and confirm that they are being created in different regions/accounts.

```
    Outputs:
    
    sg1_arn = "arn:aws:ec2:us-west-2:111111111111:security-group/sg-063c8fb1ab95ec2fe"
    sg2_arn = "arn:aws:ec2:us-east-1:222222222222:security-group/sg-04e5c4ed437502e2a"
```

Confirmed that it does.

You've provided a lot of info, but still unable to reproduce. Maybe an example repo would help. Closing this out. Feel free to provide more info though if you find more clues.

Also, consider trying:

    terraspace build demo
    cd .terraspace-cache/us-west-2/dev/stacks/demo
    terraform init
    terraform apply

That's pretty much what terraspace does. https://terraspace.cloud/docs/intro/how-terraspace-works/

So if you can get it working with plain terraform, it should in theory work with terraspace.

Note: The `.terraspace-cache` folder will use whatever your `AWS_REGION` is set to. Or if that is not set, it'll try to get it from your `~/.aws/config`, and then default to `us-east-1`. Generally speaking, that's what happens. Here's the lookup logic: https://github.com/boltops-tools/aws_data/blob/master/lib/aws_data.rb
